_posts/2017-04-30-Emulating-Sparql-queries-in-emacs-lisp-with-pattern-matching.html
---
title: Emulating Sparql queries in emacs-lisp with pattern matching
date: 2017/04/30 13:46:47
updated: 2017/04/30 13:46:47
categories: emacs,lisp
tags: 
---


<p>
Sqarql is a query language for RDF triples. A triple is a data structure that consists of a (subject predicate object). Sparql lets you query the triples to extract data from them. I have been interested in using these to augment the <a href="http://kitchingroup.cheme.cmu.edu/blog/2017/01/03/Find-stuff-in-org-mode-anywhere/">SQL databases I generate</a> from my org-files to be able to infer relationships between subjects and objects. For example, I could encode relationships into the contact database I use, and then infer new information that is not encoded explicitly. So far though I haven't found a good Sparql database that I can easily integrate into Emacs (or even play around with). I am reading On Lisp these days and chapters 18 and 19 talk about destructuring and pattern matching, and I realized these can be used to implement something like Sparql queries on simple lisp data structures. In this post I explore what it looks like and how to do it.
</p>

<p>
Let's consider a small database of triples that codify relationships between two people. For example, we can codify that Ann is Bob's mother with (Bob mother Ann). Here is our little database.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">setq</span> triples '((Bob mother Ann)
                (Bill father Bob)
                (Lucy mother Jane)
                (Bob wife Jane)))
</pre>
</div>

<p>
We can filter out facts from the database with a -filter. Here we filter out triples about Bob. Emacs has nice pattern matching in the pcase macro (see <a href="http://www.wilfred.me.uk/blog/2017/03/19/pattern-matching-in-emacs-lisp/">http://www.wilfred.me.uk/blog/2017/03/19/pattern-matching-in-emacs-lisp/</a> and <a href="http://newartisans.com/2016/01/pattern-matching-with-pcase/">http://newartisans.com/2016/01/pattern-matching-with-pcase/</a> for example). It turns out this is an amazing way to solve this problem. Here we look at triples with the pattern that they start with Bob.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(-filter (<span style="color: #0000FF;">lambda</span> (triple) (<span style="color: #0000FF;">pcase</span> triple (`(Bob ,_ ,_) t))) triples)
</pre>
</div>

<p>
And here we get all the mothers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(-filter (<span style="color: #0000FF;">lambda</span> (triple) (<span style="color: #0000FF;">pcase</span> triple (`(,_ mother ,_) t))) triples)
</pre>
</div>

<p>
We can infer some facts about these people from the database by using some "rules". For example, there is not an entry that tells us directly who Bill's grandmother is. If we assume that the mother of a person's father is their grandmother, then we can infer Bill's grandmother is Ann. In this post, we examine how to write code that can find that answer. We will use pattern matching on pairs of triples to do it.
</p>

<p>
We can enumerate pairs of triples, and use pattern matching to find the pair of triples that meet the criteria we specify. The criteria we want to match is (in pseudo-sparql):
</p>

<pre class="example">
(Bill father ?dad) (?dad mother ?grandmother)
</pre>

<p>
In other words, we want to find a triple that contains Bill as the subject, father as the predication, and then his father will be the object, and then find another triple that matches a predicate of mother with the subject equal to the father object we found in the first triple, and the object of the second triple will be Bill's grandmother. We enumerate pairs of triples for the comparison. Here is a way to do that. It is not a very efficient way to do it; it would be better to first filter out the triples that match (Bill father <i>something</i>) and then filter out the triples that match (<i>anything</i> mother <i>any other thing</i>) <i>and</i> then consider the pairs of those triples. I will save that for another day; efficiency is not the point today ;)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">loop</span> for i below (length triples)
      append
      (<span style="color: #0000FF;">loop</span>
       for j below (length triples)
       if (not (= i j))
       collect
       (list (nth i triples) (nth j triples))))
</pre>
</div>

<p>
You can see the pair that matches is the fourth one down (actually the first one matches too, but not exactly in the order of the pattern we specified). Next, we use pcase for the pattern matching. This amazing macro allows you to specify a pattern in terms of reusable variables so we can specify that the same value exists in multiple places. We will use this pattern (in pcase syntax):
</p>

<pre class="example">
`((Bill father ,dad) (,dad mother ,grandmother))
</pre>

<p>
That means match a list that has the first element of (Bill father <i>something</i>) and store the value of <i>something</i> in the variable dad. The second element of the list must match (<i>something</i> mother <i>another thing</i>) and store the value of <i>another thing</i> in the variable grandmother. The two variables dad and grandmother are then available in the body of the pcase statement. Here is the code to loop over the triples and return the result when we find a match.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">catch</span> '<span style="color: #D0372D;">result</span>
  (<span style="color: #0000FF;">loop</span> for i below (length triples)
        do
        (<span style="color: #0000FF;">loop</span>
         for j below (length triples)
         if (not (= i j))
         collect
         (<span style="color: #0000FF;">pcase</span> (list (nth i triples) (nth j triples))
           (`((Bill father ,dad) (,dad mother ,grandmother))
            (<span style="color: #0000FF;">throw</span> '<span style="color: #D0372D;">result</span> (format <span style="color: #008000;">"Bill's dad is %s and his grandmother is %s"</span> dad grandmother)))))))
</pre>
</div>

<p>
Not bad. It would be worthwhile to encapsulate that into a macro perhaps, so you could just write something like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">select</span> (dad grandmother) from triples where `((Bill father ,dad) (,dad mother ,grandmother)))
</pre>
</div>

<p>
For fun I implemented a limited version of this below. It is fairly limited, and lightly tested. The biggest limitation is we hard-coded the search over pairs of triples. This version searches by brute force too, because I don't know how to build in filtering yet. It is another exercise for another day to remove these limitations. Here I just want to try out the macro with the syntactic sugar of "from" and "where" (which are totally ignored) as well at the backquoted query.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">select</span> (<span style="color: #6434A3;">&amp;rest</span> args)
  (<span style="color: #0000FF;">let</span> ((values (first args))
        (db (third args))
        (query (fifth args)))
    `<span style="color: #D0372D;">(catch </span>'<span style="color: #D0372D;">result</span>
       (<span style="color: #0000FF;">loop</span> for i below (length ,db)
             do
             (<span style="color: #0000FF;">loop</span>
              for j below (length ,db)
              if (not (= i j))
              do
              (<span style="color: #0000FF;">pcase</span> (list (nth i triples) (nth j triples))
                (,query
                 (<span style="color: #0000FF;">throw</span> '<span style="color: #D0372D;">result</span> (list ,@values)))))))))
</pre>
</div>

<p>
Here is a fun way to write the query that finds the grandmother of the person named Bill with variable capture.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">select</span> (person dad grandmother) from triples
        where `((,(<span style="color: #0000FF;">and</span> person (<span style="color: #0000FF;">let</span> Bill person)) father ,dad) (,dad mother ,grandmother)))
</pre>
</div>

<p>
We can see the grandmother is Ann, as we found before.
</p>

<p>
Let's have a look at the macro expansion. Clearly our macro hides a lot of work from us!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(macroexpand '(select (person dad grandmother) from triples
        where `((,(<span style="color: #0000FF;">and</span> person (<span style="color: #0000FF;">let</span> Bill person)) father ,dad) (,dad mother ,grandmother))))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Bill</td>
<td class="org-left">Bob</td>
<td class="org-left">Ann</td>
</tr>
</tbody>
</table>

<p>
How about another example query. Who is Lucy's dad? The most direct query would be `(Lucy father ,dad), but a) that fact is not in the database, and b) our select macro won't search a single query anyway. So, let's examine how to find the answer by inference.
</p>

<p>
Let's assume that Lucy's dad is also the husband of her mother. Let's also assume that we can infer that if we know Jane is the wife of Bob, then Bob is the husband of Jane, and so we can infer from our database that Bob is Lucy's dad. This results in a query on a pair of triples that matches a pattern like:
</p>

<pre class="example">
(Lucy mother ?mom) (?dad wife ?mom)
</pre>

<p>
Here is that query in our select macro.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">select</span> (person mom dad) from triples
        where `((,(<span style="color: #0000FF;">and</span> person (<span style="color: #0000FF;">let</span> Lucy person)) mother ,mom) (,dad wife ,mom)))
</pre>
</div>

<p>
Pretty cool! Clearly there is still a lot to do to make this practical. The implementation I used here wouldn't scale well with large numbers of triples, and its limited to a single kind of query. Chapters 18 and 19 in On Lisp address the query limitation (and they are not even limited to triples) and a different syntax style that is more Sparql like. When I get through them, I will probably add a new post on it. There are a lot of interesting problems to solve here including what to do if there are multiple matches, or inconsistent data? The Sparql select command allows you to group, order and limit the results which would be increasingly useful with larger triple stores. That would definitely add a lot of code to the macro!
</p>
<p>Copyright (C) 2017 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2017/04/30/Emulating-Sparql-queries-in-emacs-lisp-with-pattern-matching.org">org-mode source</a></p>
<p>Org-mode version = 9.0.5</p>